package labs.lab09;

public class Lab09 {
    public static void main(String[] args) {
        //Лабораторная 09Ж: Обработка исключений
        //Все методы должны иметь проверку параметров и генерировать исключения при
        //необходимости.

        //ЗАДАНИЕ 01. Написать метод для поиска наибольшего элемента в двумерном массиве.

        //ЗАДАНИЕ 02. Написать метод, который проверяет, является ли двумерный массив квадратным.

        //ЗАДАНИЕ 03. Написать метод, который, в двумерном массиве (матрице) ищет строку, сумма
        //элементов которой является максимальной среди всех строк матрицы.

        //ЗАДАНИЕ 04. Двумерный массив MxN заполнить случайными символами алфавита

        //ЗАДАНИЕ 05. * Дан массив чисел numbers, и дан массив weight такой же длины.
        // Задача: написать метод, который бы случайно выбирал число из первого массива,
        // которое есть во втором массиве.
    }



}
