package labs.lab11;

public class Lab11 {
    public static void main(String[] args) {
        //ЗАДАНИЕ 01. Написать метод, который читает текстовый файл и возвращает
        // его в виде списка строк.
        //ЗАДАНИЕ 02. Написать метод, который записывает в файл строку,
        // переданную параметром.
        //ЗАДАНИЕ 03. Используя решение 1 и 2, напишите метод, который склеивает
        // два текстовых файла один.
        //ЗАДАНИЕ 04. Написать метод для копирования файла (побайтно, или массивами байт).
        //ЗАДАНИЕ 05. Написать метод, который в каталоге ищет файлы, в имени
        // которых содержится определенная строка, и который возвращает список
        // имен таких файлов.
        //ЗАДАНИЕ 06. Написать метод, который в каталоге ищет текстовые файлы,
        //содержавшие определенную строку. Возвращает список имен таких файлов.
        // (FilenameFilter)
    }
}
