package labs.lab06;

public class Lab06 {
    public static void main(String[] args) {
        /**Лабораторная 06: Структуры данных*/

        //Задание 01: Доработать Класс Study
        //Создать Конструктор, который принимает и устанавливает поле course.
        //Создать объект класса с параметром course == «Изучение Java - это просто!
        //Вывести значение класса используя метод «printCourse»
        Study study = new Study("Изучение Java - это просто!");
        System.out.println(study.printCourse());

        //Задание02: Создайте класс Дом. Добавьте в него следующие данные:
        //●	поля: количество этажей, год постройки, наименование;
        //●	метод для установки всех значений;
        //●	метод для вывода всех значений;
        //●	метод, возвращающий количество лет с момента постройки.
        //На основе класса создайте два объекта и пропишите для каждого
        // характеристики. Добавление характеристик реализуйте через
        // метод класса.
        //Выведите информацию про каждый объект.



    }
}
